def phq_question():
    print("")

print("สวัสดี คุณชื่ออะไรหรอ ?")
firstname = input("ชื่อ :")
lastname = input("นาสกุล :")
nickname  = input("ชื่อเล่น : ")

fullname = firstname +" "+lastname
print ("ยินดีที่ได้รู้จักคุณ :", fullname)
print ("ฉันชื่อ KAPX :3 ขอเรียกคุณว่า คุณ", nickname)
pass

print("ก่อนอื่นฉันอยากให้คุณทำคำถามประเมินสุขภาพจิต phq-9 ซึ่งมีทั้งหมด 9 ข้อ โดยคำถามแต่ละข้อจะมีระดับการให้คะแนนดังนี้")
print("0 = ไม่เลย")
print("1 = เป็นบางวัน")
print("2 = เป็นบ่อย ")
print("3 = เป็นประจำ")
print("เมื่อคุณทำแบบประเมินเสร็จ ฉันจะแจ้งการประเมินให้คุณทราบ")
pass

def phq(answer):
    answer = input("เริ่มกันเลยไหม? (y/n): ")
    if answer == "y":
        print("โอเค เริ่มกันเลย")
        pass
        
    else:
        print("น่าเสียดายจังเลย ไม่โอกาสหน้ามาใหม่นะ")
        '/'
        #break
phq("answer")

    
def phq_9():
    num1=  int(input("คุณมีอาการเบื่อ ทำอะไร ๆ ก็ไม่เพลิดเพลิน:"))
    num2=  int(input("คุณไม่สบายใจ ซึมเศร้า หรือท้อแท้:"))
    num3 = int(input("คุณมีอาการหลับยาก หรือหลับ ๆ ตื่น ๆ หรือหลับมากไป:"))
    num4 = int(input("คุณเหนื่อยง่าย หรือไม่ค่อยมีแรง:"))
    num5 = int(input("คุณเบื่ออาหาร หรือกินมากเกินไป:"))
    num6 = int(input("คุณรู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว หรือเป็นคนทำให้ตัวเอง หรือครอบครัวผิดหวัง:"))
    num7 = int(input("คุณสมาธิไม่ดีเวลาทำอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทำงานท่ีต้องใช้ความตั้งใจ:"))
    num8 = int(input("คุณพูดหรือทำอะไรช้าจนคนอื่นมองเห็น หรือกระสับกระส่ายจนท่านอยู่ไม่นิ่งเหมือนเคย:"))
    num9 = int(input("คุณ คิดทำร้ายตนเอง หรือคิดว่าถ้าตาย ๆ ไปเสียคงจะดี:"))
    phqscore = num1+num2+num3+num4+num5+num6+num7+num8+num9
    print("คะแนนจากการประเมินสุขภาพจิตรของคุณคือ :",phqscore)
    if phqscore < 7:
        print("คุณไม่มีอาการซึมเศร้า ช่างสดใสจริงๆ!!")
    elif phqscore >7 & phqscore <=12:
        print("คุณมีอาการซึมเศร้าเล็กน้อย โชคดีนะจ๊ะ")
    elif phqscore ==13 & phqscore <=18:
        print("คุณมีอาการซึมเศร้าปานกลาง ควรไปพบแพทย์เพื่อขอคำปรึกษา")
    else:
        print("คุณมีอาการซึมเศร้าระดับรุนแรง ควรไปพบแพทย์เพื่อขอคำปรึกษาและทำการรักษา")
        return phqscore
phq_9()
